Транслятор_запросав_SQL/src/InformationRegisters/Журнал/Журнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Журнал</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоляПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Транслятор_запросав_SQL/src/InformationRegisters/СвойстваСобытия/СвойстваСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваСобытия</name>
  <attributes>
    <name>ЗначениеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Транслятор_запросав_SQL/src/CommonForms/ТехнологическийЖурналТаблица/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьЖурналНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЗЖурналПриАктивизацииСтроки(Элемент)
	Если Элементы.ТЗЖурнал.ТекущиеДанные <> Неопределено Тогда
		КлючСобытия= Элементы.ТЗЖурнал.ТекущиеДанные.КлючСобытия;
	
		ОбновитьСвойстваНаСервере(КлючСобытия);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбновитьЖурналНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Журнал.ПериодСобытия,
		|	Журнал.ДоляПериода,
		|	Журнал.Событие,
		|	Журнал.КлючСобытия,
		|	Журнал.Длительность,
		|	Журнал.Уровень,
		|	Журнал.ДлительностьСек
		|ИЗ
		|	РегистрСведений.Журнал КАК Журнал
		|ГДЕ
		|	Журнал.Замер = &Замер
		|	И Журнал.ПериодСобытия МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Замер", Замер);
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗЖурнал.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры
&НаСервере
Процедура ОбновитьСвойстваНаСервере(КлючСобытия)
	Если Не ЗначениеЗаполнено(КлючСобытия) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвойстваСобытия.КлючСобытия,
		|	СвойстваСобытия.Свойство,
		|	СвойстваСобытия.ЗначениеСвойства как Значение
		|ИЗ
		|	РегистрСведений.СвойстваСобытия КАК СвойстваСобытия
		|ГДЕ
		|	СвойстваСобытия.КлючСобытия = &КлючСобытия
		|	И СвойстваСобытия.Замер = &Замер";
	
	Запрос.УстановитьПараметр("Замер", Замер);
	Запрос.УстановитьПараметр("КлючСобытия", КлючСобытия);
	
	РезультатЗапроса = Запрос.Выполнить();

	ТЗСвойства.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры
